<template>
  <div class="legal">
    <FreeHeader />
    <div class="second-nav">
      <NuxtLink class="nav-item" to="/others/qa.html"> Q&A </NuxtLink>
      <NuxtLink class="nav-item" to="/others/privacy.html">
        隐私与COOKIE
      </NuxtLink>
      <NuxtLink class="nav-item active" to="/others/legal.html">
        法律声明
      </NuxtLink>
    </div>
    <div class="section help">
      <h2>法律声明</h2>
      <p>坚持以法律为准绳 服务于广大消费者</p>
      <i>&nbsp;</i>
      <div class="legal-detail-content">
        <h3>规则及易高家居有限公司网址访问条件</h3>
        <p>
          以下规则（以下称“使用条款”）适用于所有访问本网站的用户或浏览者，易高家居有限公司和/或其关联公司（以下统称"易高"）保留随时修改这些规则的权利。访问本网站的权利由易高根据下列条款授予。如果您不同意下列任何条款、请停止使用本网址。对于违反这些规则的行为，易高有权采取法律和公平的补救措施。
        </p>
        <h3>易高网站内容</h3>
        <p>
          本网站所载的材料和信息，包括但不限于文本、图片、数据、观点、建议、网页或链路，虽然易高力图在网站上提供准确的材料和信息，但易高并不保证这些材料和内容的准确、完整、充分和可靠性，并且明确声明不对这些材料和内容的错误或遗漏承担责任，也不对这些材料和内容作出任何明示或默示的、包括但不限于有关所有权担保、没有侵犯第三方权利、质量和没有计算机病毒的保证。
        </p>
        <p>
          易高可以在没有任何通知或提示的情况下随时对本网站上的内容进行修改，为了得到最新版本的信息，请定时访问本网站。
          易高在本网站上所提及的非易高产品或服务仅仅是为了提供相关信息，并不构成对这些产品、服务的认可或推荐。
          易高并不就网址上提供的任何产品、服务或信息做出任何声明、保证或认可，所有销售的产品和服务应受本公司的销售合同和条款的约束。
        </p>
        <h3>软件内容</h3>
        <p>
          本网站上所有源代码和二进制形式的软件、示例代码、API、SDK、相关文档和其他相关材料（统称“软件”）的所有权，包括所适用的知识产权归易高或其许可方所有。除非您跟据与易高或其关联公司的相关协议另行获得相应许可，本网站使用条款不就软件提供任何形式的许可，您不得对软件进行反向工程、反编译、反汇编、拆解、改编、植入或其他派生操作，不得以任何方式研究易高产品内部实现、获取产品源代码、窃取知识产权等，也不得披露任何软件性能测试的结果。
        </p>
        <h3>您对本网站的使用</h3>
        <p>
          您不得出于任何非法或本使用条款禁止的目的使用本网站和/或其包含的任何内容，不得将本网站和/或其包含的任何内容用于任何非法用途，也不得唆使任何非法活动或其他侵犯易高或他人权利的活动。
        </p>
        <p>
          您不得以任何非法方式，在未经授权的情况下访问本网站及其任何部分，或接受通过本网站提供的任何服务，或连接到易高服务器的任何其他系统或网络。
        </p>
        <p>
          您同意不会采取任何会对本网站及其相关的架构、系统、网络带来不合理或不成比例的高负载的行为。
        </p>
        <p>
          您不得通过本网站未提供的方式获取或试图获取本网站的任何内容，亦不得使用任何自动或手动的流程、抓取设备、程序、算法或方法，来访问、获取、拷贝或监控本网站的任何组成部分或内容。
        </p>
        <p>
          您不得以扫描等方式测试本网站和/或其网络是否存在漏洞，亦不得破坏网站及其服务所采用的安全或身份验证措施。您不得反向搜索、跟踪或试图跟踪有关易高及本网站的任何其他用户或访客的任何信息；亦不得以任何方式滥用或泄露网站内的任何服务或信息。
        </p>
        <p>
          您不得以任何方式（包括但不限于使用任何设备、软件或程序）干扰或试图干扰本网站的正常运作及其他人对本网站的正常使用。
        </p>
        <p>
          您同意在使用本网站及其内容时，遵守国家法律法规、社会公共道德。您不得利用本网站及其内容从事制作、查阅、复制和传播任何违法、侵犯他人权益等扰乱社会秩序、破坏社会稳定的行为，亦不得利用本网站及其内容从事任何危害或试图危害计算机系统及网络安全的活动。
        </p>
        <h3>商标</h3>
        <p>
          易高网站上使用和显示的所有商标、标志皆属易高或其许可人所有。易高网站所载的任何内容不应被视作未经易高或其他方书面许可，以暗示、不反对或其他形式授予使用前述任何商标、标志的许可或权利。未经事先书面许可，任何人不得以任何方式使用易高名称及易高的商标、标记。
        </p>
        <h3>隐私</h3>
        <p>
          易高的<a href="https://www.yigaojiaju.com/privacy.html">隐私声明</a
          >适用于本网站的使用。使用本网站，即表示您确认并同意易高可以根据此隐私声明使用此类信息。
        </p>
        <h3>用户账户和个人资料</h3>
        <p>
          访问本网站，或使用网站提供的某些功能或服务时，您可能需要开设一个账户、设定个人参数、或下载易高软件，网站可能还针对具体服务及功能提供额外的使用条款。如果本使用条款与针对本网站特定部分的条款之间存在冲突，则后者应约束您对本网站该部分或特定服务的使用。
        </p>
        <p>
          您不得以虚假、伪装、或冒充他人身份的方式访问本网站。如果网站某些部分需要您建立账户或设定个人信息，您提供的信息必须真实可靠。您同意确保帐户信息的安全和保密，不得让他人使用您的易高账户、配置文件、易高软件，否则您可能需为易高以及本网站的任何其他用户或访客由此而遭受的损失承担责任。
        </p>
        <p>
          易高可以自行决定是否拒绝、删除您发布的任何内容，限制、暂停、或终止您对网站的访问，且有权保留或删除您提供的任何信息或内容。
        </p>
        <h3>著作权说明</h3>
        <p>
          本网站所载的所有材料或内容受版权法的保护，所有版权由易高或其许可方拥有，但注明引用其他方的内容除外。未经易高或其他方事先书面许可，任何人不得将本网站上的任何内容以任何方式进行复制、修改、传播、经销、翻印、播放、拆解、反向工程、反编译、以超级链路连接或传送、以"镜像法"载入其他服务器上、存储于信息检索系统或者其他任何的使用。
        </p>
        <h3>提供的产品或服务</h3>
        <p>
          由于互联网的国际性或无国界性，因此通过本网站所提供的信息亦具有国际性，其中可能包含对未在您所在国家/地区发布的产品或服务的引用，所以不是所有的在本网站上所提到的产品或服务在您的国家或地区都提供，请联系当地的销售代表或经销商了解在您的国家或地区所提供的产品或服务。
        </p>
        <h3>第三方链接</h3>
        <p>
          本网站可能保留有与第三方网站或网址的链接，访问这些链接将由用户自己作出决定，易高并不保证这些链接上所提供的任何信息、数据、观点、图片、陈述或建议的准确性、完整性、充分性和可靠性。易高提供这些链接仅仅在于提供方便，并不表示易高对这些信息的认可和推荐，也不是用于宣传或广告目的。
        </p>
        <h3>免责声明</h3>
        <p>
          易高不应对间接、附带、特殊或任何形式的惩罚性赔偿承担任何责任，也不应对任何利润、收入、数据、数据使用的损失承担任何责任。除非易高在销售合同中另行书面同意，在适用法允许的范围内，易高不对本网站的“资料”承担任何责任，不论该责任因何原因引起或者基于何种侵权理论。
        </p>
        <h3>适用法律与争议解决</h3>
        <p>
          您同意，与您访问或使用本网站相关的所有事项，应根据中华人民共和国法律解释、理解和管辖。您同意，中国安徽省合肥市有管辖权的法院具有相关的管辖权。
        </p>
      </div>
    </div>
    <FreeCommon />
  </div>
</template>

<script lang="ts" setup>
useHead({
  title: "法律声明",
  meta: [
    {
      name: "description",
      content:
        "易高整家定制，国内超大型专注于高端全屋定制家具加盟代理及其配套产品研发、生产及销售的全屋定制家具加盟代理十大品牌厂家。易高整家定制涵盖家装目录所有软装定制产品，为全屋定制家具加盟代理服务解决方案5A级供应商。",
    },
    {
      name: "keywords",
      content: "全屋定制|易高定制家具|整家定制|定制家具|定制家具十大品牌",
    },
  ],
});
</script>

<style lang="less" scoped>
.second-nav {
  width: 1200px;
  margin: 0 auto;
  display: flex;
  justify-content: space-between;
  align-items: center;
  position: relative;
  top: -30px;
  background-color: #fff;
  box-shadow: 0px 10px 13px -8px #e1e1e1;
  border-bottom: none;
  height: 60px;

  .nav-item {
    width: 400px;
    text-align: center;
    color: #333;
    font-size: 16px;
    line-height: 16px;
    border-right: 1px solid #d8d8d8;
    box-sizing: border-box;

    &:nth-last-of-type(1) {
      border: none;
    }
  }

  .active {
    color: var(--theme-color);
  }
}

.help {
  width: 1200px;
  margin: 0 auto;
  padding: 60px 0 110px;

  & > h2 {
    font-size: 35px;
    color: #333;
    text-align: center;
  }

  & > p {
    font-size: 16px;
    color: #666;
    text-align: center;
    letter-spacing: 1px;
    padding: 20px 0 15px;
  }

  & > i {
    width: 80px;
    height: 20px;
    border-top: 1px solid var(--theme-color);
    display: block;
    margin: 0 auto;
  }

  .legal-detail-content {
    width: 1200px;
    margin: 0 auto;

    h3 {
      font-size: 1.5em;
      line-height: 1.5em;
      color: #333;
      margin-bottom: 20px;
    }

    p {
      text-align: left;
      font-size: 16px;
      color: #666;
      margin-bottom: 20px;
    }
  }
}
</style>
